{
    "templates": [
        {
            "id": "professional",
            "name": "Professional",
            "description": "A modern and professional resume template with a timeline-style layout for experience and education. Ideal for showcasing a clear career progression.",
            "file": "template_Professional.tex.j2",
            "is_default": false,
            "single_page": false
        },
        {
            "id": "modern",
            "name": "Modern",
            "description": "Contemporary design featuring strategic color accents and modern typography that stands out while maintaining professionalism. Ideal for creative industries, tech companies, and startups where innovation and forward-thinking are appreciated. Balances visual appeal with clear information hierarchy.",
            "file": "template_modern.tex.j2",
            "is_default": true,
            "single_page": false
        },
        {
            "id": "executive",
            "name": "Executive",
            "description": "Sophisticated and refined layout specifically designed for C-level executives, senior management, and leadership positions. Features premium styling with elegant typography and strategic use of space to convey authority and experience. Perfect for board positions and high-level consulting roles.",
            "file": "template_executive.tex.j2",
            "is_default": false,
            "single_page": false
        },
        {
            "id": "compact",
            "name": "Compact",
            "description": "Space-efficient two-column template that maximizes content density while maintaining excellent readability and professional appearance. Ideal for experienced professionals with extensive backgrounds who need to showcase comprehensive skills and achievements. Perfect for technical roles and consulting positions where detailed experience matters.",
            "file": "template_Compact.tex.j2",
            "is_default": false,
            "single_page": true
        },
        {
            "id": "elegant",
            "name": "Elegant",
            "description": "Professional template featuring a distinctive dark blue header with elegant typography and clean two-column layout for optimal information organization. Combines sophistication with modern design elements, making it perfect for finance, consulting, and professional services. Strikes the ideal balance between creativity and conservatism.",
            "file": "template_Elegant.tex.j2",
            "is_default": false,
            "single_page": true
        },
        {
            "id": "classic",
            "name": "Classic",
            "description": "Traditional professional resume with refined gold accents, clean layout, and dedicated profile picture area for a personal touch. Timeless design that works exceptionally well for academic positions, healthcare professionals, and established industries. Emphasizes credentials and experience with classic formatting that never goes out of style.",
            "file": "template_Classic.tex.j2",
            "is_default": false,
            "single_page": false
        },
        {
            "id": "dense",
            "name": "Dense",
            "description": "Ultra-compact two-column layout with strategic blue accents, profile picture area, and maximum information density for comprehensive professional profiles. Designed for senior professionals and specialists who need to present extensive experience, certifications, and achievements. Excellent for technical fields, research positions, and consulting roles.",
            "file": "template_Dense.tex.j2",
            "is_default": false,
            "single_page": true
        }
    ],
    "admin_settings": {
        "allow_template_management": true,
        "default_template": "professional"
    }
}
